tap "homebrew/bundle"
brew "asdf"
brew "git"
brew "neovim"
brew "python@3.10"
brew "rich-cli"
brew "zsh"
brew "shfmt"
brew "shellcheck"
cask "iterm2"

tap "azure/functions"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Essentials
brew "tree"
brew "gettext", link: true
brew "fzf"
brew "python", link: false
brew "yarn"
brew "node@12"

# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "openshift-cli"
brew "helm"
brew "minikube"

# Azure
brew "azure-cli"
brew "azure/functions/azure-functions-core-tools@3"
brew "terraform"
cask "powershell"

# Dev
cask "dotnet-sdk"

# Fun
brew "cmatrix"
cask "spotmenu"

# Security
mas "1Password", id: 443987910